sample/app/controllers/samples_controller.rb

    def detail
      @post = Post.find(params[:id])
---
SELECT  `Post`.* FROM `Post` WHERE `Post`.`id` = 29 LIMIT 1

    def adminLogin
      #@admin = Admin.all.limit(1)
      @admin = Admin.all.first
---
SELECT  `admin`.* FROM `admin` ORDER BY `admin`.`id` ASC LIMIT 1

    def pwdChange
      @admin = Admin.all.first
---
SELECT  `admin`.* FROM `admin` ORDER BY `admin`.`id` ASC LIMIT 1

    def pwdChangeRegist

      @admin = Admin.first
      @admin.password = params[:passwordnew1]
      @admin.save
---
SELECT  `admin`.* FROM `admin` ORDER BY `admin`.`id` ASC LIMIT 1
UPDATE `admin` SET `password` = 'nre' WHERE `admin`.`id` = 1

    def listDelete

      Post.where(id:params[:id]).delete_all
      Category.where(postid:params[:id]).delete_all
---
DELETE FROM `Post` WHERE `Post`.`id` = 9
SELECT  `Post`.* FROM `Post` WHERE `Post`.`id` = 14 LIMIT 1
DELETE FROM `category` WHERE `category`.`postid` = NULL

    def listRegist
      if params[:id].blank?
        @post = Post.new
        @category = ''
      else
        @post = Post.find(params[:id])
        @category = ''

        catelist = Category.where(postid:params[:id])
---
SELECT  `Post`.* FROM `Post` WHERE `Post`.`id` = 2 LIMIT 1
SELECT `category`.* FROM `category` WHERE `category`.`postid` = 2

    def listRegistd

      #新規か更新か
      if params[:id].blank?
        @post = Post.new
      else
        @post = Post.find(params[:id])
      end

      #postの登録
      @post.title = params[:txtTitle]
      @post.body = params[:txtBody]

      if params[:imgdata].blank?
      else
        imagedata = params[:imgdata].read
        @post.img = imagedata
      end
      @post.save

      #カテゴリの登録
      Category.where(postid:params[:id]).delete_all

      str = params[:txtCategory]

      array = str.split(",")
      array.each do |val|
        category = Category.new
        category.postid = @post.id
        category.category = val
        category.save
---
SELECT  `Post`.* FROM `Post` WHERE `Post`.`id` = 29 LIMIT 1
UPDATE `Post` SET `body` = 'ああああaaa', `updated_at` = '2020-02-24 03:18:17' WHERE `Post`.`id` = 8
INSERT INTO `Post` (`title`, `body`, `created_at`, `updated_at`) VALUES ('不正文字テスト\'あ', '不正文字テスト\'あ\r\n不正文字テスト\'あ', '2020-02-27 12:00:43', '2020-02-27 12:00:43')
DELETE FROM `category` WHERE `category`.`postid` = NULL
INSERT INTO `category` (`postid`, `category`) VALUES (29, '不正文字テスト\'あ')